<a href="https://colab.research.google.com/github/Lucas-Rodrigues-code/bcb/blob/main/ipca.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [5]:
url = 'https://api.bcb.gov.br/dados/serie/bcdata.sgs.433/dados?formato=json'

In [8]:
dados = pd.read_json(url)

In [14]:
df = pd.DataFrame(dados)
df.head(100)

          data  valor
0   01/01/1980   6.62
1   01/02/1980   4.62
2   01/03/1980   6.04
3   01/04/1980   5.29
4   01/05/1980   5.70
..         ...    ...
95  01/12/1987  14.15
96  01/01/1988  18.89
97  01/02/1988  15.70
98  01/03/1988  17.60
99  01/04/1988  19.29

[100 rows x 2 columns]